package project;

public class geo {
    public static void Geography(){
        String questG[] = { "Какая страна является крупнейшим по территории?",
                "Какой из перечисленных городов является столицей Италии?",
                "Какой материк является самым малонаселённым?",
                "Какое озеро считается самым глубоким в мире?",
                "Какая страна расположена на архипелаге, состоящем из более чем 17 тысяч островов?"
        };

        String RightAnswG[] = {
                "Россия",
                "Рим",
                "Антарктида",
                "Байкал",
                "Индонезия"
        };


    }
}
