package project;

public class math {
    public static void Math(){
        String questM[] = {"Чему равно значение выражения 2 + 2 * 3?",
                "Какое число является простым?",
                "Чему равно квадратный корень из 64?",
                "Какова площадь прямоугольника со сторонами 5 и 7?",
                "Какова сумма углов треугольника?"};
    }

    String RightAnswM[] = {
            "8",
            "17",
            "8",
            "35",
            "180 градусов"
    };
}
